; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s2-p1-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 - truck
          l0-0 l1-0 - airport
          l0-1 l1-1 - location
          p0 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l1-1)
    (at t3 l0-0)
    (at t4 l0-0)
    (at t5 l1-1)
    (at t6 l0-0)
    (at t7 l1-1)
    (at t8 l1-0)
    (at p0 l1-1)
    (at a0 l0-0)
)

(:goal
    (and
        (at p0 l0-0)
    )
)
)

; plan
1. (drive t4 l0-0 l0-1)
   deleted: (at t4 l0-0)
   added: (at t4 l0-1)
   goals met: 0 of 1
2. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 0 of 1
3. (drive t8 l1-0 l1-1)
   deleted: (at t8 l1-0)
   added: (at t8 l1-1)
   goals met: 0 of 1
4. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
5. (load t2 p0 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t2)
   goals met: 0 of 1
6. (drive t2 l1-1 l1-0)
   deleted: (at t2 l1-1)
   added: (at t2 l1-0)
   goals met: 0 of 1
7. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 1
8. (drive t4 l0-1 l0-0)
   deleted: (at t4 l0-1)
   added: (at t4 l0-0)
   goals met: 0 of 1
9. (unload t2 p0 l1-0)
   deleted: (in p0 t2)
   added: (at p0 l1-0)
   goals met: 0 of 1
10. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 1
11. (drive t3 l0-1 l0-0)
   deleted: (at t3 l0-1)
   added: (at t3 l0-0)
   goals met: 0 of 1
12. (drive t4 l0-0 l0-1)
   deleted: (at t4 l0-0)
   added: (at t4 l0-1)
   goals met: 0 of 1
13. (drive t7 l1-0 l1-1)
   deleted: (at t7 l1-0)
   added: (at t7 l1-1)
   goals met: 0 of 1
14. (drive t8 l1-1 l1-0)
   deleted: (at t8 l1-1)
   added: (at t8 l1-0)
   goals met: 0 of 1
15. (load a0 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 0 of 1
16. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 1
17. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 1
18. (drive t2 l1-0 l1-1)
   deleted: (at t2 l1-0)
   added: (at t2 l1-1)
   goals met: 0 of 1
19. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 1
20. (drive t4 l0-1 l0-0)
   deleted: (at t4 l0-1)
   added: (at t4 l0-0)
   goals met: 0 of 1
21. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 0 of 1
22. (drive t4 l0-0 l0-1)
   deleted: (at t4 l0-0)
   added: (at t4 l0-1)
   goals met: 0 of 1
23. (drive t6 l0-0 l0-1)
   deleted: (at t6 l0-0)
   added: (at t6 l0-1)
   goals met: 0 of 1
24. (drive t8 l1-0 l1-1)
   deleted: (at t8 l1-0)
   added: (at t8 l1-1)
   goals met: 0 of 1
25. (unload a0 p0 l0-0)
   deleted: (in p0 a0)
   added: (at p0 l0-0)
   goals met: 1 of 1
